Revit 2027 API
UIControlledApplication.RemoveAddInCommandBinding Method
Removes an AddInCommandBinding.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAddInCommandBinding(
	RevitCommandId revitCommandId
)
Public Sub RemoveAddInCommandBinding (
	revitCommandId As RevitCommandId
)
public:
void RemoveAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
member RemoveAddInCommandBinding :
        revitCommandId : RevitCommandId -> unit
Parameters
revitCommandId RevitCommandId
The Revit command id to identify the command handler you want to remove the binding.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when uiApplication or revitCommandId is null.
InvalidOperationException |  Thrown when the given command is not bound with this add-in.
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace